zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE317/startup_MCXE317.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
    __asm volatile ("cpsie i");
    __main();
#elif defined(__MCUXPRESSO)
    // Copy the data sections from flash to SRAM.
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

    // Load base address of Global Section Table
    SectionTableAddr = &__data_section_table;

    // Copy the data sections from flash to SRAM.
    while (SectionTableAddr < &__data_section_table_end) {
        LoadAddr = *SectionTableAddr++;
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        data_init(LoadAddr, ExeAddr, SectionLen);
    }

    // At this point, SectionTableAddr = &__bss_section_table;
    // Zero fill the bss segment
    while (SectionTableAddr < &__bss_section_table_end) {
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        bss_init(ExeAddr, SectionLen);
    }

#if defined (__cplusplus)
    // Call C++ library initialisation
    __libc_init_array();
#endif

    // Reenable interrupts
    __asm volatile ("cpsie i");

#if defined (__REDLIB__)
    // Call the Redlib library, which in turn calls main()
    __main();
#else
    main();
#endif // __REDLIB__

#elif defined(__ICCARM__)
    // Reenable interrupts
    __asm volatile ("cpsie i");

    __iar_program_start();
#elif defined(__GNUC__)
/*     Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      1. __etext/_data_start__/__data_end__
 *      2. __ram_function_flash_start/__ram_function_start__/__ram_function_end__
 *      3. __qadata_flash_start/__qadata_start__/__qadata_end__
 *      4. __noncache_data_flash_start/__noncache_data_start__/__noncache_data_end__
 *      Note: All must be aligned to 4 bytes boundary.
 */
    uint32_t *pDataSrc, *pDataDest;

    pDataSrc = (uint32_t *)__etext;
    pDataDest = (uint32_t *)__data_start__;
    while (pDataDest < __data_end__)
    {
        *pDataDest ++ = *pDataSrc++;
    }
#ifdef __STARTUP_INITIALIZE_RAMFUNCTION
    pDataSrc = (uint32_t *)__ram_function_flash_start;
    pDataDest = (uint32_t *)__ram_function_start__;
    while (pDataDest < __ram_function_end__)
    {
        *pDataDest++ = *pDataSrc++;
    }
#endif // __STARTUP_INITIALIZE_RAMFUNCTION
#ifdef __STARTUP_INITIALIZE_NONCACHEDATA
    pDataSrc = (uint32_t *)__noncache_data_flash_start;
    pDataDest = (uint32_t *)__noncache_data_start__;
    while (pDataDest < __noncache_data_end__)
    {
        *pDataDest++ = *pDataSrc++;
    }

    // zero inited ncache section initialization
    pDataDest = (uint32_t *)__noncache_bss_start__;
    while (pDataDest < __noncache_bss_end__)
    {
        *pDataDest++ = 0;
    }
#endif // __STARTUP_INITIALIZE_NONCACHEDATA
#ifdef __STARTUP_INITIALIZE_QADATA
    pDataSrc = (uint32_t *)__qadata_flash_start;
    pDataDest = (uint32_t *)__qadata_start__;
    while (pDataDest < __qadata_end__)
    {
        *pDataDest++ = *pDataSrc++;
    }
#endif // __STARTUP_INITIALIZE_QADATA
#ifdef __STARTUP_CLEAR_BSS
/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __bss_start__: start of BSS section. Must align to 4
 *      __bss_end__: end of BSS section. Must align to 4
 */
    pDataDest = (uint32_t *)__bss_start__;
    while (pDataDest < __bss_end__)
    {
        *pDataDest++ = 0;
    }
#endif // __STARTUP_CLEAR_BSS

    __asm volatile ("cpsie i");

#ifndef __START
#ifdef __REDLIB__
#define __START __main
#else
#define __START _start
#endif
#endif

    __START();

#endif

    // main() shouldn't return, but if it does, we'll just enter an infinite loop
    while (1)
    {
        ;
    }
}

#if defined(__MCUXPRESSO)
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
#else
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
__attribute__ ((used, section("InRoot$$Sections")))
#endif
__attribute__ ((naked))
void Reset_Handler(void) {
#endif // __MCUXPRESSO
    // Disable interrupts
    __asm volatile ("cpsid i");
    // Config VTOR & MSP register
    __asm volatile ("LDR R0, =0xE000ED08  \n"
                    "STR %0, [R0]         \n"
                    "LDR R1, [%0]         \n"
                    "MSR MSP, R1          \n"
                    :
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
                    : "r"(__Vectors)
#elif defined(__MCUXPRESSO)
                    : "r"(g_pfnVectors)
#elif defined (__ICCARM__)
                    : "r"(__vector_table)
#elif defined (__GNUC__)
                    : "r"(__isr_vector)
#else
#error "Unsupported toolchain!"
#endif
                    : "r0");

    // ERR052460 Workaround: Cortex-M7: A hang scenario can occur when a reserved read locked memory region is accessed by application cores
    __asm volatile ("LDR r0, =0x402AC0F0 \n"
                    "LDR r1, =0x1CB0499D \n"
                    "STR r1, [r0]        \n"
                    "LDR r1, =0xB9920D38 \n"
                    "STR r1, [r0]        \n"
                    );
    // Data Synchronization Barrier
    __asm volatile ("dsb sy");


// TCM/SRAM controller must perform a read-modify-write for any access < 32-bit(ITCM) or 64-bit to keep the ECC updated.
// The Software must ensure the TCM is ECC clean by initializing all memories that have the potential to be accessed as < 32-bit(ITCM) or 64-bit.
#if !defined(BYPASS_ECC_ITCM_INIT)
    __asm volatile ("LDR     R0, =0x00000000     \n"
                    "LDR     R1, =0x00007FFF     \n"
                    "LDR     R2, =Reset_Handler_C\n"
                    "CMP.W   R1, R2              \n"
                    "BCS.N   ram_init_itcm_done  \n"
                    "ram_init_itcm:              \n"
                    "LDR     R2, =0              \n"
                    "LDR     R3, =0              \n"
                    "LDR     R4, =0              \n"
                    "LDR     R5, =0              \n"
                    "loop01:                     \n"
                    "STMIA   R0!, {R2 - R5}      \n"
                    "CMP     R0, R1              \n"
                    "BCC.N   loop01              \n"
                    "ram_init_itcm_done:         \n"
                    );
#endif

#if !defined(BYPASS_ECC_DTCM_INIT)
    __asm volatile ("LDR     R0, =0x20000000     \n"
                    "LDR     R1, =0x2000FFFF     \n"
                    "LDR     R2, =0              \n"
                    "LDR     R3, =0              \n"
                    "LDR     R4, =0              \n"
                    "LDR     R5, =0              \n"
                    "loop02:                     \n"
                    "STMIA   R0!, {R2 - R5}      \n"
                    "CMP     R0, R1              \n"
                    "BCC.N   loop02              \n"
                    );
#endif

